app/controllers/posts_controller.rb

INSERT INTO "posts" ("city", "created_at", "latitude", "longitude", "offer_msg", "street", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
	  @post = Post.new(post_params)
	  @post.save